app/Repositories/CategoryRepository.php

    public function getWithSubCategories(): Collection
    {
        return $this->model->with('subCategories')->get();
---
select * from `sub_categories` where `sub_categories`.`category_id` in (1, 2, 3)